import logging as log_obj
logger = log_obj.getLogger("uc")


ErrorCodeMsg = {
                # 用户登录
                "10000001": "request信息解析失败",
                "10000002": "缺少参数: login",
                "10000003": "缺少参数: password",
                "10000004": "账号未注册",
                "10000005": "账号和密码不一致",
                "10000006": "账号被禁用",
                "10000007": "无法生成Token信息",
                # 用户登出
                "10001001": "request信息解析失败",
                "10001002": "缺少token参数或token已过期",
                "10001003": "Token信息删除失败",
                # 新增用户信息
                "10002001": "request信息解析失败",
                "10002002": "缺少token参数或token已过期",
                "10002003": "缺少参数: login",
                "10002004": "缺少参数: password",
                "10002005": "缺少参数: nickname",
                "10002006": "缺少参数: role",
                "10002007": "账号已被注册",
                "10002008": "没有创建当前类型账号的权限",
                "10002009": "用户基本信息存储失败",
                "10002010": "缺少参数: userList",
                # 修改用户信息
                "10003001": "request信息解析失败",
                "10003002": "缺少token参数或token已过期",
                "10003003": "缺少参数: id",
                "10003004": "账号不存在",
                "10003005": "没有修改用户信息的权限",
                "10003006": "没有修改用户基本信息的权限",
                "10003007": "用户基本信息更新失败",
                # 查询用户信息
                "10004001": "request信息解析失败",
                "10004002": "缺少token参数或token已过期",
                "10004003": "id和login参数不能同时为空",
                "10004004": "用户信息不存在",
                "10004005": "用户基本信息查询失败",
                # 删除用户信息
                "10005001": "request信息解析失败",
                "10005002": "缺少token参数或token已过期",
                "10005003": "缺少参数: id",
                "10005004": "用户信息不存在",
                "10005005": "没有删除用户基本信息的权限",
                "10005006": "用户信息删除失败",
                # 用户名是否信息
                "10006001": "request信息解析失败",
                "10006002": "缺少token参数或token已过期",
                "10006003": "缺少参数: login",
                "10006004": "用户信息查询失败",



}


def getErrMsgByCode(errCode, errObj):
    """
    错误码--获取
    """
    strCode = str(errCode)
    if errObj is None:
        err_msg = ErrorCodeMsg[strCode]
    else:
        err_msg = ErrorCodeMsg[strCode] + "<" + format(errObj) + ">"

    return err_msg

